# 1
Numpy.random를 이용하여 0과 12 사이의 정수 60개를 생성하여 Series로 정리하고, 각 정수의 빈도수를 계산하는 code를 작성하시오.

In [185]:
import numpy as np
import pandas as pd

x = pd.Series(np.random.randint(0, 13, 60))
x.value_counts()

1     8
11    7
3     7
8     6
9     6
6     5
4     5
7     5
2     4
12    3
5     3
0     1
Name: count, dtype: int64

# 2
42를 seed로 하여 표준정규분포를 따르는 20개의 무작위 수를 numpy random 함수로 생성하고, agg를 사용하여 표본수, 평균, 표준편차, 극소, 극대값을 다음과 같은 Series로 정리하시오.

In [186]:
np.random.seed(42)
df = pd.DataFrame(np.random.randn(20))
df.agg(['count', 'mean', 'std', 'min', 'max'])

               0
count  20.000000
mean   -0.171299
std     0.960028
min    -1.913280
max     1.579213

# 3
다음과 같은 series를 생성하고 index의 순서를 (C, B, D, E, A)로 바꾸어라.

A 1<br>
B 2<br>
C 3<br>
D 4<br>
E 5

In [187]:
x = pd.Series({'A':1, 'B':2, 'C':3, 'D':4, 'E':5})
x = x.reindex(['C', 'B', 'D', 'E', 'A'])
x

C    3
B    2
D    4
E    5
A    1
dtype: int64

# 4
url = "https://raw.githubusercontent.com/k5yi/econ2005/master/datasets/WeightHeight.csv"<br>
data= pd.read_csv(url, encoding='cp949')<br>


<br>1.분석 전에 describe와 info method를 이용하여 자료유형이나 missing을 포함한 기술통계값을 확인한다.<br>
2.지나치게 크거나 작은 값이 있는지 확인한다. (max, min, quantile)<br>
3.missing value를 확인한다.<br>
4.argmax나 sort를 이용해 자료에서 키가 가장 큰 관찰값을 확인한다.<br>
5.체중의 도수분포표를 만든다. 몸무게는 오름차순으로 정리한다.<br>

In [188]:
url = "https://raw.githubusercontent.com/k5yi/econ2005/master/datasets/WeightHeight.csv"
data= pd.read_csv(url, encoding='cp949')

In [189]:
data.head()

  gender  birthday  height  weight
0      m  1983년 9월   177.0    71.0
1      m  1981년 9월   180.0    73.0
2      m  1980년 9월   180.0   102.0
3      m  1985년 3월   172.0    66.0
4      m  1983년 5월   186.0    79.0

In [190]:
data.info() # 4개의 column과 120개의 행으로 이루어진 데이터이며, birthday, height, weight에 각각 9, 3, 5개의 null-value가 있다
            # gender는 문자, birthday는 문자열 데이터이고 height와 weight는 float형이다

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   gender    120 non-null    object
 1   birthday  111 non-null    object
 2   height    117 non-null    float64
 3   weight    115 non-null    float64
dtypes: float64(2), object(2)
memory usage: 3.9+ KB

In [191]:
data.describe() # 키의 최댓값은 186, 최솟값이 155인 것은 평균을 고려해보았을 때, 직관적으로도 문제가 없다
                # 몸무게의 경우에도 최소가 42, 최대가 102, 평균이 63인 것은 직관적으로 문제가 없어 보인다
                # 25, 50, 75 분위수에 따라 나타나는 값도 상식적이다

           height      weight
count  117.000000  115.000000
mean   171.598291   63.908696
std      7.593168   12.272238
min    155.000000   42.000000
25%    165.000000   52.000000
50%    172.000000   64.000000
75%    177.000000   71.000000
max    186.000000  102.000000

In [192]:
data.isna().sum() # info에서 추론한 것과 동일한 결측치가 있음을 확인할 수 있다

gender      0
birthday    9
height      3
weight      5
dtype: int64

In [193]:
data[data['birthday'].isna() | data['height'].isna() | data['weight'].isna()] # missing value를 확인해본다

    gender   birthday  height  weight
35       m  1985년 11월   170.0     NaN
36       m   1985년 8월     NaN     NaN
44       m  1986년 11월     NaN     NaN
52       f        NaN     NaN     NaN
53       m        NaN   177.0    62.0
56       f   1984년 7월   170.0     NaN
72       m        NaN   176.0    74.0
73       m        NaN   178.0    68.0
87       m        NaN   178.0    71.0
102      f        NaN   170.0    60.0
106      m        NaN   175.0    64.0
108      m        NaN   174.0    92.0
117      f        NaN   156.0    42.0

In [194]:
data.dropna(inplace=True) # 결측치를 포함한 행을 제거한다
data.isna().sum() # 모든 결측치가 제거된 것을 확인할 수 있다

gender      0
birthday    0
height      0
weight      0
dtype: int64

In [195]:
data.iloc[data['height'].argmax()] # argmax를 통해 키가 가장 큰 사람의 인덱스를 입력받아 iloc을 활용하여 해당 행을 출력한다

gender             m
birthday    1983년 5월
height         186.0
weight          79.0
Name: 4, dtype: object

In [199]:
# 체중을 기준으로 오름차순 정렬한다
data.sort_values('weight', inplace=True)
data

    gender   birthday  height  weight
88       f     20-Nov   165.0    43.0
119      f     17-Jul   166.0    45.0
103      m     14-Aug   164.0    46.0
105      f     27-Feb   163.0    47.0
21       f   1983년 6월   160.0    47.0
..     ...        ...     ...     ...
13       m  1986년 12월   183.0    85.0
76       m     22-Dec   178.0    85.0
84       m     23-Oct   173.0    92.0
19       m   1987년 2월   182.0    96.0
2        m   1980년 9월   180.0   102.0

[107 rows x 4 columns]

In [202]:
pd.cut(data['weight'], bins = [42, 52, 64, 71, 102]).value_counts().sort_index() # min, 25%, 50%, 75%, max로 구간을 나누어 도수분포표를 만든다

weight
(42, 52]     29
(52, 64]     26
(64, 71]     27
(71, 102]    25
Name: count, dtype: int64

# 5
다음의 dict으로 주어진 작업을 수행하는 code를 작성하시오.<br>
{'X':[78,85,96,80,86], 'Y':[84,94,89,83,86]}<br><br>
1.DataFrame을 생성하는 code를 작성하시오.<br>

2.Index를 ('서', '강', '대', '학', '교')로 바꾸고,<br>
3.Y에서 X의 값을 빼서 새로운 column 'Z'를 생성한 후, Column의 이름을 ("2019", "2020", "증가량")으로 바꾸시오.<br>
4.각 column의 평균을 계산하시오.<br>
5.Column '2019'의 값이 80에서 89사이인 row를 모두 (74, 90, 16)으로 대체하시오.<br>

In [54]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86]}, index=['서', '강', '대', '학', '교'])
df['Z'] = df['Y'] - df['X']
df.columns = ['2019', '2020', '증가량']
df.apply(sum)

2019    425
2020    436
증가량      11
dtype: int64

In [57]:
df[(df['2019'] <= 89) & (df['2019'] >= 80)] = [74, 90, 16]
df

   2019  2020  증가량
서    78    84    6
강    74    90   16
대    96    89   -7
학    74    90   16
교    74    90   16